Autodesk.Revit.DB.Electrical.WireType.IsInUse
Indicates whether the wire type is in use.

Autodesk.Revit.DB.Electrical.WireType.Conduit
The conduit type of the wire type.

Autodesk.Revit.DB.Electrical.WireType.NeutralSize
The maximum neutral size of the wire type.

Autodesk.Revit.DB.Electrical.WireType.NeutralRequired
Whether or not the neutral point is required.

Autodesk.Revit.DB.Electrical.WireType.NeutralMultiplier
The neutral multiplier type of the wire type.

Autodesk.Revit.DB.Electrical.WireType.MaxSize
The max size of the wire type.

Autodesk.Revit.DB.Electrical.WireType.Insulation
The insulation type.

Autodesk.Revit.DB.Electrical.WireType.TemperatureRating
The temperature rating type of the wire type.
Remarks: Should retrieved from relevant WireMaterial object.

Autodesk.Revit.DB.Electrical.WireType.WireMaterial
The material type of the wire type.

Autodesk.Revit.DB.Electrical.WireType
Represents a specific wire type.